
{"_sort_create_date":1425894480,"_sort_last_updated":1425994260,"_sort_publish_date":1425894480,"background_image":{"height":500,"resize_url":"http://lh6.ggpht.com/kpjbwarCx_6azzJSpJvk02hyaPyTYh3JZcAQHlZjtpeZV1DRtYbvJBpLPa_VPNSlEJ0lZwYdiM4d6dJTp4ouPhIDB8pMjg","size":411692,"type":"image/jpeg","url":"/webhook-uploads/1425895502663/audi_a3_etron_intro.jpg","width":960},"background_image_alt_text":"Audi A3 e-tron dashboard","create_date":"2015-03-09T10:48:00+01:00","description":"With the e-tron, Audi is jumping into the increasing popular plug-in hybrid market. By combining the top selling model with an incredible electro motor, Audi seems to be on the winning side. But can they also deliver a winning UI?","gauge_score":4,"highlight_image":{"height":470,"resize_url":"http://lh6.ggpht.com/m_Oufc0GGXjNUs5fQywJ7G2OuMRJEyZhrnxzkmjyZEyt9NmSvvFslSEg88Lre-CwS_UwVH8d6zkz4TS2tYAUrWxcL2A","size":317749,"type":"image/jpeg","url":"/webhook-uploads/1425989401163/audi_a3_etron_remarkable.jpg","width":900},"highlight_text":"<p>\n\tBy turning the control knob clockwise you scroll up in lists. You scroll down by turning it counter clockwise. We would expect this to work exactly the other way around. This caused us to turn the wheel constantly in the wrong direction, even after playing with the system for quite some time.\n</p>","highlight_title":"Taking the wrong turn","isDraft":false,"last_updated":"2015-03-10T14:31:00+01:00","name":"Audi A3 e-tron","negative_points":[{"point":"Control knob rotates in the wrong direction"}],"positive_points":[{"point":"Clear, high resolution display"},{"point":"Consistent layouts and use of colour"},{"point":"Easy control, even while driving"}],"preview_url":"67ac9a66-5859-76b8-6b5e-f70dd31f7549","publish_date":"2015-03-09T10:48:00+01:00","quote":"A consistent, coherent, snappy and intuitive setup - this makes it the best infotainment system we’ve encountered so far.","related_reviews":[{"score":80,"sub_title":"Tekna 1.5 dCi","title":"Nissan Qashqai","visual":{"height":200,"resize_url":"http://lh6.ggpht.com/iX-31Nsn4Y6RQUWaw5Hu5IpgFhrdhOXH40idGbnIPNVNmVXMgKluJ7uSfF3stEqzVZXZGEQmSu2C2SyUkHJELH2ylmj5","size":16680,"type":"image/jpeg","url":"/webhook-uploads/1425994226587/nissan-qashqai.jpg","width":280}},{"score":50,"sub_title":"Sports Tourer Business+ 2.0 CDTI","title":"Opel Insignia","visual":{"height":200,"resize_url":"http://lh5.ggpht.com/ZUiCTuL6th-dgCbBWBd-lE6EQzgLNabMjqsIhQcPJHUsgpZZ-mSPuHzJaY9-fLE2RIzu1GH5ap15RXRljTgpg5TUn3fq","size":19511,"type":"image/jpeg","url":"/webhook-uploads/1425994257999/opel-insignia-business-edition.jpg","width":280}},{"score":65,"sub_title":"Business Edition","title":"Citroën C4 Picasso","visual":{"height":200,"resize_url":"http://lh5.ggpht.com/6LJQyD2_BeP9ctfLQcNQu6UPOu-BNf1EPxGsjAlhvV95Pm2CCVj4Q4ZVcjdMCNFmB6DYzOXPHeGtXUF78nnqhKuKfuU","size":23322,"type":"image/jpeg","url":"/webhook-uploads/1425994291310/citroen-c4-picasso.jpg","width":280}}],"score":87,"sub_title":"Sportback 1.4 Attraction Pro Line Plus","summary_text":"<p>\n\tStep inside the e-tron and like any Audi cabin it's familiar but perfectly crafted. The design is clean, with every surface wrapped in soft leather or brushed aluminium. The A3 is fitted with Audi's flagship technology: MMI touch. This is the infotainment system that Audi has been refining for years. It consists of a rich 7-inch display that is controlled by a control wheel in the center console - located just under the handbrake. The central control unit contains an array of hard buttons, soft buttons, disappearing buttons, and even a fingertip sketch pad. The labels are clear, the design and layout are consistent and coherent and everything works snappy, smooth and intuitive.\n</p>\n<p>\n\tThe MMI system offers a simple menu navigation and a decent connectivity system. This system includes both USB and MDI inputs that can read and charge devices. Connecting your phone over Bluetooth is easy and straightforward.\n</p>\n<p>\n\tThe 7-inch display is bright and well readable under various light conditions. The high positioning of the screen looks a bit awkward at first, but proves to be a smart move once you start driving. Having the display this far up makes it easy to quickly scan for information and focus back on the road without having to look down onto your dashboard and lose track of what's happening outside.\n</p>\n<p>\n\tInformation is logically clustered in main menu sections and colors are thoughtfully applied to provide contrast, highlight selections and subtly set the mood. All this makes Audi's MMI touch the best infotainment system we've used so far.\n</p>","summary_title":"Doing it right","summary_visual":{"height":200,"resize_url":"http://lh6.ggpht.com/comjK0bgM9kIgWYlc-cBofyKVfmMNdFKdkwL1hMzvgmqB5Jxd5cozubrpFVF8rn4jcNUcTEqQNCFM1jQY_Axaohz0hi_","size":196974,"type":"image/jpeg","url":"/webhook-uploads/1425984888828/audi_a3_etron_test.jpg","width":900},"tagline":"Tested on December 10 2014 by Robbert Ouwerkerk, Stephan van Dijk and Jeff van Steijn","title":"Audi A3 e-tron","title_image":{"height":50,"resize_url":"http://lh3.ggpht.com/MKR21sNXE7DiKvOWA2ZLyo5Fp7mnKFLNYCBbeQG-Ebg-2HsT4tuJzICWd9iMPPF3iV3Ifbcdgh4GGyfDLbudNU8i-CZL","size":6199,"type":"image/jpeg","url":"/webhook-uploads/1425902830619/audi_a3_etron_small.jpg","width":100},"title_image_alt_text":"Audi A3 e-tron small","twitter":"Audi A3 e-tron. Score: 87/100","widget_score":[{"description":"<p>\n\tAudi made the choice to not integrate the display into the dashboard but to place it on top of it. While this does not provide an integrated feel, the screen pops up smoothly while starting the car. In combination with the subtile startup animation, it provides a luxurious feel.\n</p>\n<p>\n\tThe UI feels spacious compared to the competition. Even when showing rich data like fuel stations, parking areas and navigation cues, the screen feels organised. Audi kept the design clear and consistent throughout all applications, and smartly applies highlight colours to guide you through their screens.\n</p>","image":{"height":200,"resize_url":"http://lh4.ggpht.com/5HUm6GHcCfPRGytmSOBMKbIMrksJxA1uJbc5-yrWpOqeJhLY0Ugo-b5n5qtot9jXioUOp9gAF_YbHFBG-AkUPG9wVtNQ8Q","size":54839,"type":"image/jpeg","url":"/webhook-uploads/1425990205907/audi_a3_etron_identity.jpg","width":200},"name":"identity","score":85},{"description":"<p>\n\tAudi has resisted the temptation to fill the dashboard with a tangle of various little displays as we often encounter in hybrid cars. Instead the e-tron features a single, high resolution 7-inch color display that pops out of the dashboard when you start the car and closes when you turn it off. At first this high positioning on top of the dashboard feels a bit out of place but becomes clear once you start driving: having this display on top of the dashboard puts it closer to the windscreen. This makes it easy to quickly scan the screen for information and to focus back on the road.The display is well readable, even when the sun shines directly onto it and both day and night modes are presented in a clear way.\n</p>\n<p>\n\t<strong>Control wheel</strong>\n</p>\n<p>\n\tInteracting with the multimedia system is achieved through a control wheel and surrounding buttons. They are easily accessible on the lower part of the center console. By turning the wheel you browse through the content. While pressing it confirms the selection. It takes a little time to get used to it, but after that it works like a charm: direct, snappy, easily accessible and usable while driving.\n</p>\n<p>\n\tThe wheel has a touchpad on top that can be used for input of text and numbers. Our experience with trackpads in cars is not that great, but this one managed to surprise us with its quick and accurate gesture recognition.\n</p>","image":{"height":200,"resize_url":"http://lh5.ggpht.com/Yh4uv6llzXQgKEMIlZkCwqwaqD35L-dm0pM1F2T_C4MDmAfzWpu64_ng5Uf-9RIh2xTiOvLaWJD5aDn3uDvvivk7ILsr","size":47523,"type":"image/jpeg","url":"/webhook-uploads/1425990239137/audi_a3_etron_hardware.jpg","width":200},"name":"hardware","score":88},{"description":"<p>\n\tThe main menu options are directly accessible and the physical speed dial buttons allow easy access to the top tasks.\n</p>\n<p>\n\t<strong>Navigation</strong>\n</p>\n<p>\n\tThe map is presented in a clear, cohesive way and the animations run smooth. With its various display and view options and the Audi A3's Connect services are better than anything we encountered so far. The weather and map data look great, and are displayed in a rich way.\n</p>\n<p>\n\tEntry of the destination is straightforward and easy to do while clear steps and options to choose from guide us through the process of defining our journey. Surprisingly, the letter and number entry with the control wheel works pretty well, mainly because of the system that assists the user by smartly filtering away the characters and numbers that do not result in any search match.\n</p>\n<p>\n\tNavigation cues are clearly displayed and are also presented on the secondary display. This function is smart and makes glancing for the navigation hints quick, easy and non-dependable of the navigation screen.\n</p>","image":{"height":200,"resize_url":"http://lh6.ggpht.com/Nt3WdZbHJ3dh7eg0uMDFjNkh0nYJpb3L8cZhIy8dXSjfVfoeFOI0mF1nGMfUp8LwcRYYpqCWxcPVGYljuyZaOvR2lwwn","size":58479,"type":"image/jpeg","url":"/webhook-uploads/1425990255876/audi_a3_etron_toptasks.jpg","width":200},"name":"toptasks","score":90},{"description":"<p>\n\tWhile most other car manufacturers tend to move towards touch screens with surrounding hard-buttons, Audi sticks to it's MMI system without touch screen and with just a control wheel. Entering characters and numbers with the turning wheel takes a little to get used to, but it works great once you get the hang of it. Great advantage of the wheel is that it is remarkably easy to use while driving. It also allows you to stay focused on the road instead of trying to find and touch various buttons on a touch screen.\n</p>\n<p>\n\t<strong>Climate control</strong>\n</p>\n<p>\n\tWith the e-tron, Audi made a smart choice to stick to a turning knob for the climate control. Capacitive touch systems look modern and advanced, but lack haptic feedback on what you\\'re doing. For example: How far do you need to swipe your finger to decrease temperature by four degrees? Here, you always know: four degrees, four tactile, audible clicks.\n</p>","image":{"height":200,"resize_url":"http://lh5.ggpht.com/B8MVr9xwbee43R6MCSnesaNjzDCT6YOjKSAEmyHDPb5dseCKZEQobZxfZg42LRYdttY6I3nUYsXz3HoZ9MEkZgacd1zLnw","size":41616,"type":"image/jpeg","url":"/webhook-uploads/1425990273607/audi_a3_etron_usability.jpg","width":200},"name":"usability","score":84},{"description":"<p>\n\tThe e-tron is packed with technical goodies. Some come with the standard package, some can additionally be added. Establishing a Bluetooth connection between your phone and the car system is easy and straightforward. The Bluetooth pairing process requires multiple steps and should be executed while the car is parked. Re-connecting is achieved instantly. Contacts, media, playlists and even Spotify are easily accessible and playable.\n</p>","image":{"height":200,"resize_url":"http://lh6.ggpht.com/G-KHeaaecg-cIsq6t5yotY3o-D5yzi47xZGsRFPZrn3FB50bMkUVaIS3qRXvpiM62jWCT2i6UWetHQUPvjqdgrfcUjoefw","size":46665,"type":"image/jpeg","url":"/webhook-uploads/1425990297330/audi_a3_etron_technology.jpg","width":200},"name":"technology","score":90}],"_id":"-JjxvnNJ_mOWNTOROnsz","_type":"reviews","slug":"reviews/audi-a3-e-tron"}