
{"_sort_create_date":1425999600,"_sort_last_updated":1425999600,"_sort_publish_date":1425999600,"background_image":{"height":500,"resize_url":"http://lh4.ggpht.com/bdehV2va94uDbY0RHl3GZjqBMqAXIvPcxR9uVdY2WOwBCzqPgrRMJBOsmf1BDCZufEsFqG_INAUF-2OJ756AIZ9agbkQog","size":186435,"type":"image/jpeg","url":"/webhook-uploads/1425998991802/opel-insignia-dashboard.jpg","width":960},"background_image_alt_text":"Opel Insignia dashboard","create_date":"2015-03-10T16:00:00+01:00","description":"The Opel Insignia is the parade float of Opel. The promising exterior of the car made us curious about the rest of the car. Is the interface as beautiful and good? We went out to explore the Insignia.","gauge_score":3,"highlight_image":{"height":470,"resize_url":"http://lh6.ggpht.com/vWlI4VN7z2LPCF24XrNZPMxIYdhWiQ9lLycuLO_OwVQkeMbZmNaWqyPUg9RPT0SSdEvr7qAqtlUoyaxnqD-CXdseSzw","size":104556,"type":"image/jpeg","url":"/webhook-uploads/1425999494897/opel-insignia-highlight.jpg","width":900},"highlight_text":"<p>\n\tThere is no consistent use of the styles of the icons: you get both flat and lavish icons against: thin line icons to thick line icons and icons with bevels, gradients and shadows. In the colors of the icons is no unity. A different set of icons In addition, there is used for the hardware buttons.\n</p>","highlight_title":"Icons","last_updated":"2015-03-10T16:00:00+01:00","name":"Opel Insignia Tourer Bplus 2 0 nl","negative_points":[{"point":"Confirm the input of the touchpad"},{"point":"Icon style"},{"point":"The brightness of the design functions as a 'lamp'"}],"positive_points":[{"point":"Switching from light to dark environment"},{"point":"Love the size of the screen"}],"preview_url":"5f887a4c-6ef0-6cc5-b92b-706662c56d92","publish_date":"2015-03-10T16:00:00+01:00","quote":"I need to scan the screen and really understand what is going on in order to go to the next step.","related_reviews":[{"score":75,"sub_title":"C220 CDI Ambition Comfort","title":"Mercedes-Benz C-Klasse","visual":{"height":200,"resize_url":"http://lh6.ggpht.com/WO0vXXX6VEbJ6xu5KjX5i0VoZAXoaeteDCw0SalSIxQqVvv5IxXG4xdpCYZjjPz_cQVh-lcex9626PzFkzabHK9V5Zc","size":25134,"type":"image/jpeg","url":"/webhook-uploads/1425999562084/mercedes-c220.jpg","width":280}},{"score":68,"sub_title":"1.6 Greenline Business","title":"Skoda Octavia","visual":{"height":200,"resize_url":"http://lh6.ggpht.com/AR-dAUjjRjbkOqWsPR_0f5AUUxdjKPtNVIqsjlKmfVcJQt3myw_fGNp7zTbbmcvN4tdlWTZx7-xyoowcRElJoNE6dOs","size":19898,"type":"image/jpeg","url":"/webhook-uploads/1425999600295/skoda-octavia.jpg","width":280}},{"score":65,"sub_title":"Business Edition","title":"Citroën C4 Picasso","visual":{"height":200,"resize_url":"http://lh3.ggpht.com/bVZaXUgGZisX2c5OdjDPigP9Ybje4PT0m1TYiUeSyLCc66kx-tXFRfBSzwizGrNNXcI5XjduIrb49SSuxBhcTBHJxMM","size":23322,"type":"image/jpeg","url":"/webhook-uploads/1425999631456/citroen-c4-picasso.jpg","width":280}}],"score":60,"sub_title":"Sports Tourer Business+ 2.0 CDTI","summary_text":"<p>\n\tAfter boarding it is hard to ignore the screen. It is a big boy that takes a prominent place on the dashboard. The buttons are all nicely rounded and neatly positioned below the display. Fortunately, there are less buttons than in the previous version of the Insignia. This makes it more quiet for the driver. So prominent and large as the central display, so smallish look the analogue gauges for speed and speed. They are however beautiful, although from time to time we had to give it some effort, to see what the current speed was, when it was not given on the small display.\n</p>\n<p>\n\tThe information on the dashboard screen is clear. The fuel consumption and range are displayed in submenus. That are accessible by controls on the steering wheel. The menu structures are divided both vertically and horizontally, and that gives some confusion within such a small screen. Unfortunately no warnings are displayed on the screen.\n</p>\n<p>\n\tInteraction by way of touching the screen works moderately. This is because not all of the controls are effective. The knob works fine, but requires a lot of concentration. You have to long press the screen looking for the illogical structure of options. The buttons on the steering wheel work, but are confusing with what happens next in the menu. The touchpad that is part of the center console, is designed to facilitate the easy input of information. For example, you can draw figures. However, this requires a lot of attention from the driver, making it more a funny gadget than a functional addition that you will use often.\n</p>","summary_title":"The screen is part of the car","summary_visual":{"height":200,"resize_url":"http://lh4.ggpht.com/tXkv-RPFtbBtNop1aJ04pU_o2QN1dDm0rAOxwHMZjRAdXXQmff3mCx_lkYfRk9Vx4QeqhLLqXaUmUqGFIVtZjszdzoLb","size":70731,"type":"image/jpeg","url":"/webhook-uploads/1425999469220/opel-insignia-summary.jpg","width":900},"tagline":"Tested on May 15 2014 by Hylke van Maaren, Helder Mota and Robbert Ouwerkerk","title":"Opel Insignia","title_image":{"height":50,"resize_url":"http://lh4.ggpht.com/RCFFyCtUr2CnUDLxjS9d65XW7aqOYzYCuOfYUQRLJgP9mJL6WX-4TdbLZz2yNYWMpnslekc9dh5Vx7a_sbu-8iJOS9EU","size":2644,"type":"image/jpeg","url":"/webhook-uploads/1425999011697/opel-insignia-small.jpg","width":100},"title_image_alt_text":"Opel Insignia","twitter":"Opel Insignia Sports Tourer Business+ 2.0 CDTI. Score: 50/100","widget_score":[{"description":"<p>\n\tThe screen is well integrated in the center console, which ensures a beautiful whole. The small digital display integrated into the dashboard, is well adapted to the analog speed and fuel indicators. Unfortunately, the touch screen feels cheap and it works slowly. We did expect more from a mid-range car from Opel.\n</p>\n<p>\n\t<strong>Design</strong>\n</p>\n<p>\n\tThe buttons you see on the screen are inconsistent: some buttons are placed in a box and other buttons not. Also the sizes of the buttons differ. This coupled with the lack of a logical visualization of your action is unclear what features or tests you are using. That way you have to first sift through the entire screen to understand what is happening, and then go to the next step.\n</p>","image":{"height":400,"resize_url":"http://lh6.ggpht.com/DFnNUlTa4gSZw-x63NmMi3SDBR9Mr7hbdhWup0WVG97VunZadshXEj6hVog7-nv6Kbw6N5kRlErfgQ5Ii5a1fpwfZb2M","size":55412,"type":"image/jpeg","url":"/webhook-uploads/1425999135219/opel-insignia-identiteit.jpg","width":400},"name":"identity","score":60},{"description":"<p>\n\tThe screen itself is very readable. The only problem is that the screen is deeply incorporated in the console: two to three inches deep. This obscures the buttons, which are placed close to the edges. The \"Favorites\" button for example, placed in the lower right corner, you can not even see when you sit low or stoop slightly.\n</p>\n<p>\n\t<strong>Nightmode</strong>\n</p>\n<p>\n\tThe display switches to night mode at night, but also when entering a tunnel for example. The black background with light lettering is ideal for driving in the dark. However it takes between four and five second, before the night mode is activated. As a result you are dazzled by the display when entering a tunnel. And when you are out of the tunnel it takes a few seconds before you can read anything again. Also the switch in light intensity is inmediatlye, and not gradually. This is very noticeable and a bit distracting.\n</p>","image":{"height":400,"resize_url":"http://lh6.ggpht.com/_nrSNP_R7NPF8uVSnYPmRGHQPuR0bKorY9pyWMuG4VCX2e079_hbeJa93kqIrhpJff4GFMqdm_w0vuAqkJia-Ba9ZJDP9A","size":50618,"type":"image/jpeg","url":"/webhook-uploads/1425999209896/opel-insignia-hardware.jpg","width":400},"name":"hardware","score":65},{"description":"<p>\n\tThe items in the main menu are \"audio\", \"navigation\" and \"telephone\". When you open one of these items you quickly get lost because of the large amounts of options, controls and buttons. Visual hierarchy is missing here. For example, there is no focus on top or subtasks and even the 'next' and 'previous' options are not used consistently. For example, the 'back' button varies from bottom right to top left, depending on the menu where you are in. This ensures that for any user it is hard to operate the system in a logical and natural way.\n</p>","image":{"height":400,"resize_url":"http://lh6.ggpht.com/mLMLE4ZFP-VIqcS5dioaTvSoWmVZp-rnpmb9tBXcX1GBHyBbL-4l73hvUta4yHKfTFVEMYcjfyt7BznLOdIpMCobzYssog","size":46142,"type":"image/jpeg","url":"/webhook-uploads/1425999265301/opel-insignia-toptaken.jpg","width":400},"name":"toptasks","score":45},{"description":"<p>\n\tWe think there are too many interaction mechanisms to control the interface. And they all work in a different way. This is confusing. The center console can be operated by touch, but has an inconsistent use of button forms and sizes. Also, some buttons are not suitable for touch while driving, such as the keyboard for the phone. The way of operating is sometimes disappointing: for instance you can not swipe through a long list. And you are forced to use the arrows to navigate from top to bottom. Also the volume control can only be used one button long press.\n</p>\n<p>\n\tThe labels are confusing. On the home screen there are two items, both of which have been labeled \"phone\" while they have a different function. You have to set up a radio station to read the manual. And even that is not clear enough.\n</p>","image":{"height":400,"resize_url":"http://lh6.ggpht.com/QVNnMyIeSLPjjYgPUMmyfGe7i0x-cBLqZVEjy_n2Q3hGJDu911XWSi_nsnX04S8I_LuzWYjA-5DQHvRa-8-MGDCqTMal2A","size":46668,"type":"image/jpeg","url":"/webhook-uploads/1425999315407/opel-insignia-usability.jpg","width":400},"name":"usability","score":50},{"description":"<p>\n\tThe Insigina features a touchpad that belongs to the center console. This is located next to the handbrake. The touchpad can be used as \"drawing pad\" for entering text or numbers. You activate it with a button that is next to it. Every action with the touchpad requires text input, for example destinations in case of navigating. Although the letter recognition works reasonably well, drawing letters takes quite some effort and time. The fact that no support is offered in the form of predictive results or filters based on the current input, this input method is very time consuming and error prone. Another small annoyance is that the touchpad does not have an 'ENTER' or 'OK' option. This means that you still need to touch the screen to proceed to the next step. Actually, if you want to enter anything, the on-screen keyboard works so much faster and easier.\n</p>","image":{"height":400,"resize_url":"http://lh3.ggpht.com/e2A2aDbLKIn80htYFaMwVe7XXTbJ3NtcwSVIwvnawI_kcj1o7VFtGBrQK1qaqqUFewmnhteUOAWEs--s4YJ-y5rJC8mvRg","size":37380,"type":"image/jpeg","url":"/webhook-uploads/1425999359365/opel-insignia-technologie.jpg","width":400},"name":"technology","score":40}],"_id":"-Jk3Bxxg5XLHzfeimBWN","_type":"reviews","slug":"reviews/opel-insignia-tourer-bplus-2-0-nl"}